app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT `clients`.* FROM `clients`