app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO `products` (`name`, `price`, `created_at`, `updated_at`) VALUES ('Açai 300ml', 8.5, '2019-05-19 18:48:12', '2019-05-19 18:48:12')