app/controllers/sales_controller.rb

SELECT `sales`.* FROM `sales`
---
  def index
    @sales = Sale.all

INSERT INTO `sales` (`client_id`, `payment_id`, `total_price`, `created_at`, `updated_at`) VALUES (1, 1, 20.5, '2019-05-19 19:33:54', '2019-05-19 19:33:54')
INSERT INTO `product_sales` (`product_id`, `sale_id`, `created_at`, `updated_at`) VALUES (1, 9, '2019-05-19 19:57:41', '2019-05-19 19:57:41')
INSERT INTO `sales` (`client_id`, `payment_id`, `total_price`, `created_at`, `updated_at`) VALUES (1, 1, 20.5, '2019-05-19 19:31:07', '2019-05-19 19:31:07')
---
  def create
    @sale = Sale.new(sale_params)


    if @sale.save
      render json: @sale, status: :created, location: @sale

      params[:products].each do |product|
        @product_sale = {:product_id => product[:id], :sale_id => @sale[:id]}
        ProductSale.create(@product_sale)

SELECT  `sales`.* FROM `sales` WHERE `sales`.`id` = 1 LIMIT 1
---
    def set_sale
      @sale = Sale.find(params[:id])